app/views/acidentes/index.html.erb

SELECT "acidentes".* FROM "acidentes"
---
      <span>Acidentes agrupados por natureza</span>
      <%= pie_chart Acidente.group(:natureza).count %>