app/controllers/acidentes_controller.rb

SELECT "acidentes".* FROM "acidentes"
---
    def index
        # @acidentes = Acidente.all

        if params[:select_vitimas]
            if params[:select_vitimas] == :com
                @acidentes = Acidente.where(:vitimas > 0)
            elsif params[:select_vitimas] == :sem
                @acidentes = Acidente.where(:vitimas == 0)
            else
                @acidentes = Acidente.all

SELECT  "acidentes".* FROM "acidentes" WHERE "acidentes"."id" = ? LIMIT 1  [["id", 3]]
---
    def show
        @acidente = Acidente.find(params[:id])

INSERT INTO "acidentes" ("vitimas", "local", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["vitimas", "SIM"], ["local", "BV"], ["created_at", "2017-05-26 22:04:08.921625"], ["updated_at", "2017-05-26 22:04:08.921625"]]
---
    def create
        @acidente = Acidente.new(acidente_params)

        @acidente.save