app/controllers/comments_controller.rb

SELECT  "acidentes".* FROM "acidentes" WHERE "acidentes"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("autor", "body", "acidente_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["autor", "Hiro_teste_1"], ["body", "Olá"], ["acidente_id", 1], ["created_at", "2017-05-27 02:28:06.040818"], ["updated_at", "2017-05-27 02:28:06.040818"]]
---
    def create
        @acidente = Acidente.find(params[:acidente_id])
        @comment = @acidente.comments.create(comment_params)

SELECT  "acidentes".* FROM "acidentes" WHERE "acidentes"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."acidente_id" = ? AND "comments"."id" = ? LIMIT 1  [["acidente_id", 1], ["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
    def destroy
        @acidente = Acidente.find(params[:acidente_id])
        @comment = @acidente.comments.find(params[:id])
        @comment.destroy